/****************************************************************************
	*	@笔者	：	W
	*	@日期	：	2019年12月28日
	*	@所属	：	杭州众灵科技
	*	@论坛	：	www.ZL-robot.com
	*	@功能	：	存放按键相关的函数
	*	@函数列表：
	*	1.	void key_init(void) -- 初始化按键
 ****************************************************************************/

/*******按键管脚映射表*******/
#define KEY1_PIN			006
#define KEY2_PIN			007

/*******按键快捷指令表*******/
#define KEY1	 digitalRead(KEY1_PIN)			//读取按键1状态
#define KEY2	 digitalRead(KEY2_PIN)			//读取按键2状态

/***********************************************
	函数名称:		key_init() 
	功能介绍:		初始化按键
	函数参数:		无
	返回值:			无
 ***********************************************/
void key_init(void) {
	pinMode(KEY1_PIN,INPUT_PULLUP);					//设置引脚为输入模式
	pinMode(KEY2_PIN,INPUT_PULLUP);					//设置引脚为输入模式
}